CheatSheet.org
#+TITLE: F# Cheat Sheet
# SUBTITLE: ---Reference Sheet for “What I'm Currently Learning”---
#+MACRO: blurb Reference sheet of the basics of F# ^_^
#+AUTHOR: [[http://www.cas.mcmaster.ca/~alhassm/][Musa Al-hassy]]
#+EMAIL: alhassy@gmail.com
#+INCLUDE: CheatSheet/CheatSheetSetup.org
#+PROPERTY: header-args :results replace
#+TODO: Todo | spacing LaTeX
* LaTeX Extra, Local, Setup  :ignore:

# Empty by default.
#+LATEX_HEADER: \def\cheatsheeturl{https://github.com/alhassy/FSharpCheatSheet}

# The following are the defaults & may be omitted.
#+LATEX_HEADER: \def\cheatsheetcols{2}
#+LATEX_HEADER: \landscapetrue
#+LATEX_HEADER: \def\cheatsheetitemsep{-0.5em}

# Example unicode declarations; see section “unicode” below.
#+LATEX_HEADER: \newunicodechar{𝑻}{\ensuremath{T}}
#+LATEX_HEADER: \newunicodechar{⊕}{\ensuremath{\oplus}}
#+LATEX_HEADER: \newunicodechar{≈}{\ensuremath{\approx}}

* COMMENT ~LaTeX~ commands ↦ ~#+latex: \LaTeX~

  Execute the following block, with ~C-c C-c~ anywhere inside it,
  to hide all LaTeX specific items away so that, for example, the generated HTML
  does not show them.

  #+BEGIN_SRC emacs-lisp :results no
(defun my/replace-in-buffer (this that)
  "Replace every occurance of regexp ‘this’ with ‘that’
   in the current buffer."
   (interactive)
   (save-excursion
    (beginning-of-buffer)
    (while (re-search-forward this nil t)
      (replace-match that)
    ))
)

;; Replace newline, any number of space, then room or vspace with a #+latex: beforehand.
(let (this that)
  (dolist (kp '( ( "^[ ]*\\\\room" . "#+latex: \\\\room")
         ( "^[ ]*\\\\vspace" . "#+latex: \\\\vspace")
         ( "^[ ]*\\\\newpage" . "#+latex: \\\\newpage")
         ( "^[ ]*\\\\columnbreak" . "#+latex: \\\\columnbreak")
         ))
    (setq this (car kp))
    (setq that (cdr kp))
    (my/replace-in-buffer this that)
   )
)
  #+END_SRC

  #+RESULTS:

* Administrivia
#+latex: \hspace{-1.3em}
  F# is a strict, statically, and strongly typed, multi-paradigm, language
  where types are inferred. It supports first-order functions and currying.

  Roughly,
  |F# ≈ [[https://github.com/alhassy/OCamlCheatSheet][OCaml]] + C#|

  + Single-line comments begin with ~//~.
  + Multi-line comments are enclosed in ~(* ⋯ *)~.

  + Here's an example of explicit type annotations.
    #+BEGIN_SRC fsharp
let x : int = 3
let first (x : 'a) (y: 'b) : 'a = x
#+END_SRC

  + Being “strongly typed” means that F# does little to no coercions, casts, for you.
    #+BEGIN_SRC fsharp
// 5 / 2.5 (* Crashes: 5 and 2.5 are different types *)
  float 5 / 2.5
≈ 5.0 / 2.5
≈ 2.0
#+END_SRC

     F#'s conversion functions are named by the type they convert to; akin to C casts.
     - E.g., ~int 23.1~ and ~int "23"~ both yield the integer ~23~.
     - ~string~ is then the traditional “to string” method.

* Getting Started

  #+latex: \hspace{-1.3em}
  The F# REPL and compiler are named ~fsi/fsc~ on Windows and ~fsharpi/fsharpc~ on Mac/Linux.
( Running these in Emacs Shell stalls; use ~ansi-term~ instead! )

| Ubuntu | ~sudo apt install mono-complete fsharp~ |
| Mac    | ~brew install mono~                     |

#+latex: \begin{parallel}

 *Emacs Setup*
#+BEGIN_SRC emacs-lisp
(use-package fsharp)
(use-package ob-fsharp)
#+END_SRC


#+latex: \vspace{1em}\hrule\vspace{1em}
The ~[<EntryPoint>]~ is necessary for using ~fsharpc~.

#+latex: \columnbreak

*Example Source File*
#+BEGIN_SRC fsharp :tangle "CheatSheet.fs"
module CheatSheet

let myInt = 1972;;

[<EntryPoint>]
let main argv
  = printfn "%s" (string myInt)
    0
#+END_SRC

#+latex: \end{parallel}

In a terminal, one runs ~fsharpi CheatSheet.fs~ to load this script,
then ~open CheatSheet;;~ to have unqualified access to all contents; otherwise
type in ~CheatSheet.myInt;;~ to access items.
One may enter multiple lines in the REPL, then execute them by entering ~;;~.
Use ~#quit;;~ to leave the REPL.

Execute ~fsharpc CheatSheet.fs; mono CheatSheet.exe~ to compile the file then run it.
#
# (shell-command-to-string "fsharpc --nologo CheatSheet.fs; mono CheatSheet.exe")

:More:
We may omit the ~open~ clause by, say, passing another file that has the commands we want executed at the REPL.
The following with ~fsharpi --nologo CheatSheet.fs --use:"here.fs"~ yields ~1972~.
#+BEGIN_SRC fsharp :tangle here.fs
open CheatSheet
#+END_SRC
:End:

** COMMENT More ;; Homemade Interactive Emacs F# Setup

Recommended: Follow the instructions bellow to obtain an F# compiler,
then install fsharp-mode in Emacs (M-x package-refresh-contents,
M-x package-install fsharp-mode) or follow the instructions on the F# homepage to set up VSCode.

Provides support for the F# language in Emacs. Includes the following features:

+ Support for F# Interactive
+ Displays type signatures and tooltips
+ Provides syntax highlighting and indentation.
+ Intellisense support.

  #+BEGIN_SRC emacs-lisp :tangle no
(shell-command-to-string "fsharpc --nologo CheatSheet.fs; mono CheatSheet.exe")



(local-set-key (kbd "<f6>") (lambda () (interactive)
  "
    org-babel-tangle the whole file, then execute the final query
    in the current SRC block.

    If the query mentions the variable ‘X’, then show all possible solutions
    followed by ‘false’. Usually one presses ‘;’ to see other solutions,
    but in Emacs this only shows one futher solution then terminates.
    We get around this by executing essentially
    “forall(your-query-with-X, writeln(X)).”
    This prints all solutions X to your query.

    If you want to use a variable but don't want to see all solutions,
    then avoid using ‘X’; e.g., use ‘Y’ ^_^.
  "
  (let ((kill-buffer-query-functions nil)
        (inhibit-read-only t)
        (buf "*FSharp*")
        (target (car (org-babel-tangle))))

    ;; Kill any existing ansi-terms without question.
    (ignore-errors
      ; (switch-to-buffer buf)
      (kill-buffer buf))

    ;; Get final expression in current source block
    (search-forward "#+END_SRC")
    (previous-line)
    (setq xx (thing-at-point 'line t))


    (when nil ;; Not needed; ansi-term w/ bash works fine.
      ;; Leaving this alternative here in-case needed in the future.

      ;; Sending the expression at the prompt wont work as expected since the fsharpi command
      ;; stalls within Emacs. Instead, we make an auxilairy file with the desired queries,
      ;; then pass that to the command line tool.
      (with-temp-buffer
        (insert "open CheatSheet\n")
        (insert xx)
        (write-file "___here.fs"))

      (async-shell-command "fsharpi --nologo CheatSheet.fs --use:\"___here.fs\"")
      (other-window 1))

    ;; Make a term process NAME in a buffer, running PROGRAM.
    ;; The name of the buffer is made by surrounding NAME with ‘*’s.
    ;; 3ʳᵈ argument is a startfile, and remaining arguments are args to the program.
    ;; E.g., (switch-to-buffer (make-term "FSharp" "echo" nil "hi"))
    (switch-to-buffer (make-term "FSharp" "fsharpi" nil "--nologo" "CheatSheet.fs" "--use:here.fs" "--warn:0"))


    ;; (ansi-term "bash")
    ;; (other-window 1)
    ;; (end-of-buffer)
    ;; (insert (format "fsharpi --nologo %s" target))
    ;;    (comint-send-input nil t) ;; Send it, i.e., “press enter at prompt”.
    ; (end-of-buffer)
    ; (insert "23;;")
    ; (comint-send-input nil t) ;; Send it, i.e., “press enter at prompt”.

  ;;
)))

(when nil
  ;; Paste the final query
  (insert xx)
  (comint-send-input nil t) ;; Send it, i.e., “press enter at prompt”.

  ;; Insert query again, but do not send, in case user wishes to change it.
  (insert xx)
  (previous-line) (end-of-line)
)
#+END_SRC

* Functions
#+latex: \hspace{-1.3em}
  A function is declared with the ~let~ keyword
---variables are functions of zero arguments.
Function & varaible names /must/ begin with a lowercase letter, and may use _ or ~'~.
+ Identifiers may have spaces and punctuation in them if they are enclosed in double-backticks;
    but no unicode or dashes in-general.
    #+BEGIN_SRC fsharp
let ``this & that`` = 2
#+END_SRC

+ Functions are like variables, but with arguments, so the same syntax applies.

#+begin_parallel org
#+BEGIN_SRC fsharp
(* A curried function *)
let f x y = x + y

(* Function application *)
let result = f 10 (2 * 6)

(* Partial application *)
let g x = f x 2
#+END_SRC

#+latex: \columnbreak
#+BEGIN_SRC fsharp

#+END_SRC
#+BEGIN_SRC fsharp
// Composition
let sum9 = f 4 >> f 5

// Threading: x |> f  ≈  f x
1 |> f 4 |> fun x -> 2 //// ⇒ 2
#+END_SRC

Recursive definitions are marked with the ~rec~ keyword.
#+BEGIN_SRC fsharp
let rec fact n
  =  if n = 0
     then 1
     else n * fact (n - 1)
#+END_SRC
#+end_parallel

#+latex: \vspace{-1em}
 Here's an example of a higher-order function & multiple local functions
 & an infix operator & an anonymous function & the main method is
 parametricly polymorphic.
#+BEGIN_SRC fsharp
let try_add (bop : 'a -> 'a -> 'a) (test : 'a -> bool)
            (fallback : 'a) (x : 'a) (y : 'a)
  = (* (/@/) x y  =  x /@/ y *)
    let (/@/) x y = bop x y
    let wrap a = if test a then a else fallback
    wrap x /@/ wrap y

699 = try_add (+) (fun a -> a % 3 = 0) (666) (-1) 33
(* The anonymous function uses ‘=’ as Boolean equality. *)

-2 = -2 % 3 (* /Remainder/ after dividing out 3s *)
#+END_SRC

Top level and nested functions are declared in the same way;
the final expression in a definition is the return value.

We also have the η-rule: ~(fun x -> f x) = f~.

F# has extension methods, like C#.
That is, types are “open” ---as in  [[https://alhassy.github.io/RubyCheatSheet/CheatSheet.pdf][Ruby]].
#+BEGIN_SRC fsharp
type System.String with
    member this.IsCool = this.StartsWith "J"

// Try it out.
true = "Jasim".IsCool
#+END_SRC

* spacing break                                                      :ignore:
#+latex: \columnbreak
* Booleans
#+latex: \hspace{-1.3em}
Inequality is expressed with ~<>~.
#+BEGIN_SRC fsharp
(* false, true, false, true, false, true, true, 1 *)
let x , y = true , false
in x = y, x || y, x && y, x >= y, 12 < 2, "abc" <= "abd"
, 1 <> 2, if x then 1 elif y then 2 else 3
#+END_SRC

