README.md
Reference sheet of the basics of F# ^\_^

◈ [Website](https://alhassy.github.io/FSharpCheatSheet/) ◈

**The listing sheet, as PDF, can be found
 [here](CheatSheet.pdf)**,
 or as a [single column portrait](CheatSheet_Portrait.pdf),
 while below is an unruly html rendition.

This reference sheet is built from a
[CheatSheets with Org-mode](https://github.com/alhassy/CheatSheet)
system.


# Table of Contents

1.  [Administrivia](#org6b07e8e)
2.  [Getting Started](#orgb5e877e)
3.  [Functions](#org80188a5)
4.  [Booleans](#org62df07c)
5.  [Strings](#org2fc550b)
6.  [Records](#org8d34d3c)
7.  [Variants and Pattern Matching](#org5088cd6)
8.  [Tuples and Lists](#orgc23d264)
9.  [Options](#org2ec44b9)
10. [Side Effects ---Unit Type](#orgb1c12e3)
11. [Printing & Integrating with C#](#orgfb8ae57)
12. [Reads](#org450c66b)















<a id="org6b07e8e"></a>

# Administrivia

F# is a strict, statically, and strongly typed, multi-paradigm, language
where types are inferred. It supports first-order functions and currying.

Roughly,

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">F# ≈ [OCaml](https://github.com/alhassy/OCamlCheatSheet) + C#</td>
</tr>
</tbody>
</table>

-   Single-line comments begin with `//`.
-   Multi-line comments are enclosed in `(* ⋯ *)`.

-   Here's an example of explicit type annotations.

        let x : int = 3
        let first (x : 'a) (y: 'b) : 'a = x

-   Being “strongly typed” means that F# does little to no coercions, casts, for you.

        // 5 / 2.5 (* Crashes: 5 and 2.5 are different types *)
          float 5 / 2.5
        ≈ 5.0 / 2.5
        ≈ 2.0

    F#'s conversion functions are named by the type they convert to; akin to C casts.

    -   E.g., `int 23.1` and `int "23"` both yield the integer `23`.
    -   `string` is then the traditional “to string” method.


<a id="orgb5e877e"></a>

# Getting Started

  The F# REPL and compiler are named `fsi/fsc` on Windows and `fsharpi/fsharpc` on Mac/Linux.
( Running these in Emacs Shell stalls; use `ansi-term` instead! )

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Ubuntu</td>
<td class="org-left">`sudo apt install mono-complete fsharp`</td>
</tr>


<tr>
<td class="org-left">Mac</td>
<td class="org-left">`brew install mono`</td>
</tr>
</tbody>
</table>

**Emacs Setup**

    (use-package fsharp)
    (use-package ob-fsharp)

The `[<EntryPoint>]` is necessary for using `fsharpc`.

**Example Source File**

    module CheatSheet

    let myInt = 1972;;

    [<EntryPoint>]
    let main argv
      = printfn "%s" (string myInt)
        0

In a terminal, one runs `fsharpi CheatSheet.fs` to load this script,
then `open CheatSheet;;` to have unqualified access to all contents; otherwise
type in `CheatSheet.myInt;;` to access items.
One may enter multiple lines in the REPL, then execute them by entering `;;`.
Use `#quit;;` to leave the REPL.

Execute `fsharpc CheatSheet.fs; mono CheatSheet.exe` to compile the file then run it.


<a id="org80188a5"></a>

# Functions

  A function is declared with the `let` keyword
&#x2014;variables are functions of zero arguments.
Function & varaible names *must* begin with a lowercase letter, and may use \_ or `'`.

-   Identifiers may have spaces and punctuation in them if they are enclosed in double-backticks;
    but no unicode or dashes in-general.

        let ``this & that`` = 2

-   Functions are like variables, but with arguments, so the same syntax applies.

<div class="parallel">
    (* A curried function *)
    let f x y = x + y

    (* Function application *)
    let result = f 10 (2 * 6)

    (* Partial application *)
    let g x = f x 2



    // Composition
    let sum9 = f 4 >> f 5

    // Threading: x |> f  ≈  f x
    1 |> f 4 |> fun x -> 2 //// ⇒ 2

Recursive definitions are marked with the `rec` keyword.

    let rec fact n
      =  if n = 0
         then 1
         else n * fact (n - 1)

</div>

Here's an example of a higher-order function & multiple local functions
& an infix operator & an anonymous function & the main method is
parametricly polymorphic.

    let try_add (bop : 'a -> 'a -> 'a) (test : 'a -> bool)
                (fallback : 'a) (x : 'a) (y : 'a)
      = (* (/@/) x y  =  x /@/ y *)
        let (/@/) x y = bop x y
        let wrap a = if test a then a else fallback
        wrap x /@/ wrap y

    699 = try_add (+) (fun a -> a % 3 = 0) (666) (-1) 33
    (* The anonymous function uses ‘=’ as Boolean equality. *)

    -2 = -2 % 3 (* /Remainder/ after dividing out 3s *)

Top level and nested functions are declared in the same way;
the final expression in a definition is the return value.

We also have the η-rule: `(fun x -> f x) = f`.

F# has extension methods, like C#.
That is, types are “open” &#x2014;as in  [Ruby](https://alhassy.github.io/RubyCheatSheet/CheatSheet.pdf).

    type System.String with
        member this.IsCool = this.StartsWith "J"

    // Try it out.
    true = "Jasim".IsCool



<a id="org62df07c"></a>

# Booleans

Inequality is expressed with `<>`.

    (* false, true, false, true, false, true, true, 1 *)
    let x , y = true , false
    in x = y, x || y, x && y, x >= y, 12 < 2, "abc" <= "abd"
    , 1 <> 2, if x then 1 elif y then 2 else 3
