CheatSheet.org
* Strings
#+latex: \hspace{-1.3em}
F# strings are not arrays, or lists, of characters as in C or Haskell.
#+BEGIN_SRC fsharp
"string catenation" = "string " ^ "catenation"

Seq.toList "woah"  // ⇒ ['w'; 'o'; 'a'; 'h']

Printf.printf "%d %s" 1972 "taxi";;

let input = System.Console.ReadLine()
#+END_SRC

* Records
  #+latex: \hspace{-1.3em}
  Records: Products with named, rather than positional, components.

#+BEGIN_SRC fsharp
type Person = {Name: string; Work: string}

(* Construction *)
let jasim = {Name = "Jasim"; Work = "Farm"}

(* Pattern matching for deconstruction *)
let {Name = who; Work = where} = jasim
    // ⇒ who = "Jasim" && where = "Farm"
let {Name = woah} = jasim  // ⇒ woah = "Jasim"
let go {Name = qx; Work = qy} = qx.Length + 2

(* Or we can use dot notation -- usual projections *)
let go' p = p.Name ^ p.Work

(* Or using explicit casing *)
let go'' x =
  match x with
    | {Name = n} -> n
    | _ -> "Uknown"

(* “copy with update” *)
let qasim = {jasim with Name = "Qasim"}
#+END_SRC

# latex: \columnbreak
Types are “open”, as in [[https://alhassy.github.io/RubyCheatSheet/CheatSheet.pdf][Ruby]].
#+BEGIN_SRC fsharp
type Person with
    member self.rank = self.Name.Length

qasim.rank // ⇒ 5
#+END_SRC

* Variants and Pattern Matching
  # Algebraic Data Types

#+latex: \hspace{-1.3em}
Sums, or “variants”: A unified way to combine different types into a single type;
+ Essentially each case denotes a “state” along with some relevant “data”.
+ Constructors must begin with a capital letter.
+ We may parameterise using OCaml style, ~'a~, or/and C# style, ~<'a>~.
#+BEGIN_SRC fsharp
type 'a Expr = Undefined | Var of 'a | Const of int | Sum of Expr<'a> * 'a Expr

let that = Const 2 (* A value is one of the listed cases. *)
#+END_SRC

The tags allow us to /extract/ components of a variant value
as well as to case against values by inspecting their tags.
This is /pattern matching/.
+   ~match⋯with⋯~ let's us do case analysis; underscore matches anything.
+ Patterns may be guarded using ~when~.
+  Abbreviation for functions defined by pattern matching: ~function cs ≈ fun x -> match x with cs~

#+BEGIN_SRC fsharp
let rec eval = function
    | Undefined  as u             -> failwith "Evil"  (* Throw exception *)
    | Var x                       -> 0 + match x with "x" -> 999 | _ -> -1
    | Const n    when n <= 9      -> 9
    | Sum (l, r)                  -> eval l + eval r
    | _                           -> 0 (* Default case *)

4   = eval that
-1  = (Var "nine" |> eval)
999 = eval (Var "x")
0   = eval (Const 10)

(* Type aliases can also be formed this way *)
type myints = int
let it : myints = 3
#+END_SRC

Note that we can give a pattern a name; above we mentioned ~u~,
but did not use it.

+ Repeated & non-exhaustive patterns trigger a warning; e.g., remove the default case above.

+ You can pattern match on numbers, characters, tuples, options, lists, and arrays.
  - E.g., ~[| x ; y ; z|] -> y~.


Builtins: [[https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/options][Options]] and [[https://msdn.microsoft.com/visualfsharpdocs/conceptual/core.choice%255b%2527t1%252c%2527t2%255d-union-%255bfsharp%255d][Choice]] ---these are known as ~Maybe~ and ~Either~ in Haskell.
#+BEGIN_SRC fsharp
type 'a Option = None | Some of 'a
type ('a, 'b) Choice = Choice1Of2 of 'a | Choice2Of2 of 'b
#+END_SRC

See [[https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/pattern-matching][here]] for a complete reference on pattern matching.

* spacing break                                                      :ignore:
#+latex: \columnbreak
* Tuples and Lists
  #+latex: \hspace{-1.3em}
  Tuples: Parentheses are optional, comma is the main operator.
#+BEGIN_SRC fsharp
  let mytuple  : int * string * float = (3, "three", 3.0)

  (* Pattern matching & projection *)
  let (woah0, woah1, woah2) = mytuple
  let add_1and4 (w, x, y, z) = w + z
  let that = fst ("that", false)

  (* A singelton list of one tuple !!!!  *)
  let zs = [ 1, "two", true ]

  (* A List of pairs *)
  ['a',0 ; 'b',1 ; 'c', 2]

  (* Lists:  type 'a list = [] | (::) of 'a * 'a list  *)
  let xs = [1; 2; 3]
  [1; 2; 3] = 1 :: 2 :: 3 :: [] (* Syntactic sugar *)

  (* List catenation *)
  [1;2;4;6] = [1;2] @ [4;6]
  (* Pattern matching example; Only works on lists of length 3 *)
  let go [x; y; z] = x + y + z
  14 = go [2;5;7]
  #+END_SRC

#+BEGIN_SRC fsharp
(* Crashes: Incomplete pattern matching *)
match [1; 2; 3] with
 | []     -> 1
 | [x; y] -> x
 // | (x :: ys) -> x
#+END_SRC

:More:
+ Syntax: ~[x₀; ...; xₙ]~

  - Tuples are optionally enclosed in parens;
    hence ~[x₀, ..., xₙ]~ is a singleton list
    consisting of only one tuple!

   # ocaml:
   # + Expected functionals:
   #     ~List.nth~ for list lookup,
   #     ~List.map~, ~List.filter~, etc.
   #

+ Cons operation is denoted ~::~.

  # ocaml:
  # + Arrays have syntax ~[|x₀; ...; xₙ|]~
  #    with 0-indexing lookup ~arr.(n)~.
  #
:End:

Here is ~[0 ; 3 ; 6 ; 9 ; 12]~ in a number of ways:
#+BEGIN_SRC fsharp
   [0..3..14]                                   (* Ranges, with a step    *)
≈ [for i in 0..14 do if i % 3 = 0 then yield i] (* Guarded comprehensions *)
≈ [for i in 0..4 -> 3 * i]                      (* Simple comprehensions  *)
≈  List.init 5 (fun i -> 3 * i)
    (* First 5 items of an “unfold” starting at 0 *)
#+END_SRC
# ≈ [0..14] |> List.map (fun x -> if x % 3 = 0 then [x] else []) |> List.concat

Expected: concat, map, filter, sort, max, min, etc.
~fold~ starts from the left of the list, ~foldBack~ starts from the right.
~reduce~ does not need an inital accumulator.
#+BEGIN_SRC fsharp
zs |> List.reduce (+)  // ⇒ 9
(* Example of a simple “for loop”. *)
[1..10] |> List.iter (printfn "value is %A")
#+END_SRC

Arrays use ~[|⋯|]~ syntax, and are efficient,
but otherwise are treated the same as lists;
Pattern matching & standard functions are nearly identical.
E.g., ~[| 1; 2 |]~ is an array.

# latex: \columnbreak

Lazy, and infinite, structures are obtained by ‘sequences’.


* spacing break                                                      :ignore:
#+latex: \columnbreak
* Options
#+latex: \hspace{-1.3em}
[[https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/options][Option]]: Expressing whether a value is present or not.
#+BEGIN_SRC fsharp
  (* type 'a option = None | Some of 'a *)

  let divide x y = if y = 0 then None else Some (x / y)
  None = divide 1 0

  let getInt ox = match ox with None -> 0 | Some x -> x
  2 = getInt (Some 2)
  #+END_SRC

* Side Effects ---[[https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/unit-type][Unit Type]]
#+latex: \hspace{-1.3em}
Operations whose use produces a side-effect return the ~unit~ type.
This’ akin to the role played by ~void~ in C.
A /function/ is a sequence of expressions; its /return value/
is the value of the final expression ---all other expressions
are of unit type.

#+begin_parallel org
#+BEGIN_SRC fsharp
(* type unit = () *)
let ex : unit = ()

let myupdate (arr : 'a array) (e : 'a)
         (i : int) : unit
  = Array.set arr i e

let nums = [| 0; 1; 2|]
myupdate nums 33 1
33 = nums.[1]
#+END_SRC

#+latex: \columnbreak
#+BEGIN_SRC fsharp
let my_io () = printfn "Hello!"

let first x y
  = my_io ()
    let _ = y
    x

let res = first 1972 12
#+END_SRC
#+end_parallel

#+latex: \vspace{-1em}
* Printing & Integrating with C#
  #+latex: \hspace{-1.3em}
We may use the ~%A~ to generically print something.
#+BEGIN_SRC fsharp :results output
// ⇒ 1 2.000000 true ni x [1; 4]
printfn "%i %f %b %s %c %A" 1 2.0 true "ni" 'x' [1; 4]
#+END_SRC

# latex: \hspace{-1.3em}
  Let's use [[https://docs.microsoft.com/en-us/dotnet/api/system.int32.parse?view=netframework-4.8][C#'s integer parsing]] and printing methods:
#+BEGIN_SRC fsharp :results output
let x = System.Int32.Parse("3")
System.Console.WriteLine("hello " + string x)
#+END_SRC

