CheatSheet.org
* Reads

#+latex: {\color{white}.}\vspace{-1em}

+ [[https://fsharp.org/learn.html][F# Meta-Tutorial]]
+ [[https://learnxinyminutes.com/docs/fsharp/][Learn F# in ~60 minutes]] ---https://learnxinyminutes.com/
+ [[https://fsharpforfunandprofit.com/series/why-use-fsharp.html][F# for Fun & for Profit!]] -- EBook
  - [[https://fsharpforfunandprofit.com/series/why-use-fsharp.html][Why use F#?]] ---A series of posts
+ [[https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/options][Microsoft's .Net F# Guide]]
  - [[https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/options][F# Language Reference]]
+ [[https://www.youtube.com/watch?v=c7eNDJN758U&list=PLGLfVvz_LVvSX7fVd4OUFp_ODd86H0ZIY&index=47&t=0s][Learn F# in One Video]] ---[[https://www.youtube.com/playlist?list=PLGLfVvz_LVvSX7fVd4OUFp_ODd86H0ZIY][Derek Banas' “Learn in One Video” Series]]
+ [[https://realworldocaml.org/][Real World OCaml]] ---F# shares much syntax with OCaml
+ [[https://en.wikibooks.org/wiki/F_Sharp_Programming][F# Wikibook]]

** COMMENT Named & Optional arguments
     https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/parameters-and-arguments

   #+BEGIN_SRC fsharp
  (* Labelled arguments, using ‘~’, means position is irrelevant *)
  [1; 2; 3] = List.map f=String.Length ["a", "ab", "abc"]
  [1; 2; 3] = List.map  ~f:String.length ["a", "ab", "abc"];;
 #+END_SRC

* COMMENT Other things to explore

  ➩ traits/typeclasses in F#.
  ➩ mutable records and references.
  ➩ calling F# from C# code.

** COMMENT F# is an OO language as well.
 Here's how we would do interfaces and inheritance.
 #+BEGIN_SRC fsharp
type IMonoid<'a> =
    abstract empty : 'a
    abstract sum   : 'a -> 'a -> 'a

type IGroup<'a> =
    inherit IMonoid<'a>
    abstract inverse : 'a -> 'a

// An implementation
type Integers =
    interface IGroup<int> with
        member ___.inverse(e) = - e
        member ___.sum x y    = x + y
        member ___.empty      = 0
 #+END_SRC

 #+RESULTS:
 #+begin_example
type IMonoid<'a> =
  interface
    abstract member empty : 'a
    abstract member sum : 'a -> 'a -> 'a
  end
type IGroup<'a> =
  interface
    inherit IMonoid<'a>
    abstract member inverse : 'a -> 'a
  end
type Integers =
  class
    interface IGroup<int>
  end
 #+end_example

** COMMENT Modules

   Modules group items together.

** COMMENT Active Patterns ≈ DTL Views                           :from_fs_cs:
 Active Patterns - Active patterns allow programmers to wrap ad hoc values and objects in union-like structures for use in pattern matching.
 https://en.wikibooks.org/wiki/F_Sharp_Programming/Active_Patterns

 -----------------------------------------------------------------------------------------

   Complete active patterns:

 let (|Even|Odd|) i =
     if i % 2 = 0 then Even else Odd

 let testNumber i =
     match i with
     | Even -> printfn "%d is even" i
     | Odd -> printfn "%d is odd" i
 Parameterized active patterns:

 let (|DivisibleBy|_|) by n =
     if n % by = 0 then Some DivisibleBy else None

 let fizzBuzz = function
     | DivisibleBy 3 & DivisibleBy 5 -> "FizzBuzz"
     | DivisibleBy 3 -> "Fizz"
     | DivisibleBy 5 -> "Buzz"
     | i -> string i
 Partial active patterns share the syntax of parameterized patterns but their active recognizers accept only one argument.
* COMMENT single column format

Press ~C-c C-c~ on the following incantation to produce a single column portrait of the cheat sheet.
#+name: make-portrait
#+BEGIN_SRC emacs-lisp :results none
(with-temp-buffer
    (insert
    "#+EXPORT_FILE_NAME: CheatSheet_Portrait.pdf
     ,#+LATEX_HEADER_EXTRA: \\landscapefalse \\def\\cheatsheetcols{1}
     ,#+INCLUDE: CheatSheet.org
    ")

    (let ((org-export-use-babel nil))
      (org-mode)
      (org-latex-export-to-pdf)))
#+END_SRC

* spacing COMMENT break :accomodating_multiple_formats:ignore:

#+LATEX: \ifnum\cheatsheetcols=1 \newpage \else \columnbreak \fi

* COMMENT Making ~README.org~

  Evaluate the following source block with ~C-c C-c~
  to produce a ~README~ file.

#+NAME: make-readme
#+BEGIN_SRC emacs-lisp
(with-temp-buffer
    (insert
    "#+EXPORT_FILE_NAME: README.md
     # HTML: <h1> Easily Making CheatSheets with Org-mode </h1>
     ,#+OPTIONS: toc:nil d:nil
     # Toc is displayed below at a strategic position.

     {{{blurb}}}

     ◈ [[https://alhassy.github.io/FSharpCheatSheet/][Website]] ◈

    ,*The listing sheet, as PDF, can be found
     [[file:CheatSheet.pdf][here]]*,
     or as a [[file:CheatSheet_Portrait.pdf][single column portrait]],
     while below is an unruly html rendition.

     # Markdown links: [title](target)

     This reference sheet is built from a
     [[https://github.com/alhassy/CheatSheet][CheatSheets with Org-mode]]
     system.

     ,#+TOC: headlines 2
     ,#+INCLUDE: CheatSheet.org
    ")

    ;; No code execution on export
    ;; ⟪ For a particular block, we use “:eval never-export” ⟫
    ;;
    (let ((org-export-use-babel nil))
      (org-mode)
      (org-md-export-to-markdown)))
#+END_SRC

#+RESULTS: make-readme
: README.md

* COMMENT footer

0. The first “eval” below is convenience matter
   that should be loaded whenever CheatSheet.org is opened.

1. The second “eval” makes a README for the repo, whenever the file is opened,
   and is then bound to ~f11~ for convenience.

2. Likewise, the third eval is for making a portrait form of the cheatsheet ---~f12~.

3. :TOC: should not be exported in this file.

   See https://github.com/snosov1/toc-org for more on toc-org.

   (add-to-list 'org-export-exclude-tags "TOC")
   (delete "TOC" org-export-exclude-tags)

    And every time you'll be saving an org file, the first headline with a :TOC:
    tag will be updated with the current table of contents.
    (toc-org-enable)

# Local Variables:
# eval: (progn (visual-line-mode t) (require 'ox-extra) (ox-extras-activate '(ignore-headlines)))
# eval: (local-set-key (kbd "<f11>") '(lambda () (interactive) (org-babel-goto-named-src-block "make-readme") (org-babel-execute-src-block) (outline-hide-sublevels 1)))
# eval: (local-set-key (kbd "<f12>") '(lambda () (interactive) (org-babel-goto-named-src-block "make-portrait") (org-babel-execute-src-block) (outline-hide-sublevels 1)))
# eval:    (add-to-list 'org-export-exclude-tags "TOC")
# eval: (progn (visual-line-mode t) (require 'ox-extra) (ox-extras-activate '(ignore-headlines)))
# compile-command: (org-latex-export-to-pdf)
# End:
