README.md


<a id="org450c66b"></a>

# Reads

-   [F# Meta-Tutorial](https://fsharp.org/learn.html)
-   [Learn F# in ~60 minutes](https://learnxinyminutes.com/docs/fsharp/) ---<https://learnxinyminutes.com/>
-   [F# for Fun & for Profit!](https://fsharpforfunandprofit.com/series/why-use-fsharp.html) &#x2013; EBook
    -   [Why use F#?](https://fsharpforfunandprofit.com/series/why-use-fsharp.html) &#x2014;A series of posts
-   [Microsoft's .Net F# Guide](https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/options)
    -   [F# Language Reference](https://docs.microsoft.com/en-us/dotnet/fsharp/language-reference/options)
-   [Learn F# in One Video](https://www.youtube.com/watch?v=c7eNDJN758U&list=PLGLfVvz_LVvSX7fVd4OUFp_ODd86H0ZIY&index=47&t=0s) ---[Derek Banas' “Learn in One Video” Series](https://www.youtube.com/playlist?list=PLGLfVvz_LVvSX7fVd4OUFp_ODd86H0ZIY)
-   [Real World OCaml](https://realworldocaml.org/) &#x2014;F# shares much syntax with OCaml
-   [F# Wikibook](https://en.wikibooks.org/wiki/F_Sharp_Programming)
